Revit 2024 API
ParameterUtils.GetAllBuiltInParameters Method
 Gets the identifiers of all built-in parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static IList<ForgeTypeId> GetAllBuiltInParameters()
Visual Basic
Public Shared Function GetAllBuiltInParameters As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetAllBuiltInParameters()
Return Value
 The built-in parameter identifiers.
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace